{
  "backend/main.mo": "Backend actor managing jobs, user profiles, saved jobs, and admin‑gated job creation with allowlisted companies, keywords, and locations.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and tests with confidence levels.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme color variables and base element styles.",
  "frontend/index.html": "HTML entrypoint with enhanced pre‑React loading fallback UI and error message container.",
  "frontend/src/App.tsx": "Main React app wiring authentication, tab navigation, filters, layout components, and profile‑setup modal.",
  "frontend/src/components/alerts/EmailAlertsPanel.tsx": "Provides UI to enable email alerts, enter an email, preview a generated job summary email, and copy or open it via mailto.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity and handles authentication state and errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal for initial user profile setup and submits name/email to the backend.",
  "frontend/src/components/filters/LocationMultiSelect.tsx": "Offers a list of selectable job locations using checkboxes and tracks selected locations.",
  "frontend/src/components/filters/TitleKeywordFilter.tsx": "Toggles a keyword-based job title filter and shows an accordion listing all keywords.",
  "frontend/src/components/jobs/JobCard.tsx": "Displays individual job details with apply, source, save, and metadata sections.",
  "frontend/src/components/jobs/JobList.tsx": "Fetches and renders a list of jobs with loading, error, empty, and count states.",
  "frontend/src/components/jobs/SaveJobButton.tsx": "Allows authenticated users to save or unsave a job and shows appropriate tooltips.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the top header with search, navigation tabs, logo, login button, and mobile menu.",
  "frontend/src/components/layout/FilterSidebar.tsx": "Provides mobile and desktop filter panels with controls for title keywords and location filters.",
  "frontend/src/components/saved/SavedJobsPanel.tsx": "Displays saved jobs, showing login prompt if unauthenticated and listing saved job IDs when available.",
  "frontend/src/components/summary/DailySummaryPanel.tsx": "Fetches filtered jobs and shows those posted in the last 24 hours with loading and error states.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and shows a recovery UI with reload and retry options.",
  "frontend/src/constants/companyAllowlist.ts": "Defines an allowlist of companies and a helper to check if a company is permitted.",
  "frontend/src/constants/locations.ts": "Lists allowed job locations for filtering.",
  "frontend/src/constants/titleKeywords.ts": "Defines title keywords and provides a function to check if a job title contains any of them.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced state value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, and logout functions.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching jobs, saved jobs, user profiles, and applying job filtering logic.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/emailDraft.ts": "Generates a daily job summary email with formatted job details.",
  "frontend/src/lib/formatters.ts": "Formats nanosecond timestamps into human-readable relative dates with fallback handling.",
  "frontend/src/lib/jobSource.ts": "Maps JobSource enum values to readable job source labels.",
  "frontend/src/lib/time.ts": "Checks whether a job's nanosecond timestamp is within the last 24 hours.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins.",
  "project_state.json": "Stores project metadata, issues, and features related to redeployment and loading fallback improvements."
}